{
    "title": "Projects Gallery",
    "projects": [
      {
        "id": 1,
        "name": "Poke.Dex",
        "image": "src/assets/img/pokeDex.png",
        "description": "Aplicación centrada en el consumo eficiente de API y la implementación de Context en React. Este proyecto demuestra mi habilidad para manejar datos dinámicos y gestionar el estado de la aplicación de manera efectiva.",
        "url": "https://github.com/hector1489/Poke.dex"
      },
      {
        "id": 2,
        "name": "Star-Wars.Dex",
        "image": "src/assets/img/starwarsapi.png",
        "description": "Aplicación dedicada al consumo de la API de Star Wars (Swapi). La aplicación presenta información detallada en tarjetas, con imágenes incorporadas desde un directorio local. Este proyecto ilustra mi capacidad para integrar datos externos de manera efectiva.",
        "url": "https://github.com/hector1489/starWarsApi"
      },
      {
        "id": 3,
        "name": "Ecommerce Pizza",
        "image": "src/assets/img/mammaMia.png",
        "description": "Ecommerce Pizza es mi proyecto de comercio electrónico desarrollado en Vite y React, con la elegancia añadida de React-bootstrap. Esta aplicación destaca mi habilidad para crear interfaces de usuario interactivas y atractivas.",
        "url": "https://github.com/hector1489/pizzasEcommerce"
      },
      {
        "id": 4,
        "name": "Registro de Colaboradores",
        "image": "src/assets/img/colaboradores.png",
        "description": "Desarrollé una sólida planilla base para el registro de colaboradores, destacando mi capacidad para estructurar y gestionar datos de manera eficiente. Este proyecto puede adaptarse fácilmente a las necesidades específicas de cualquier equipo.",
        "url": "https://github.com/hector1489/BaseColaboradores"
      },
      {
        "id": 5,
        "name": "Iguana page",
        "image": "src/assets/img/iguana.png",
        "description": "Iguana Page es un proyecto de blog de prueba que demuestra mi destreza en el manejo de diseño con display en flex y float. Este proyecto es un testimonio de mi capacidad para crear interfaces atractivas y responsivas.",
        "url": "https://github.com/hector1489/iguanapage"
      },
      {
        "id": 6,
        "name": "Cuppon",
        "image": "src/assets/img/cuppon.png",
        "description": "Cuppon es un documento HTML enriquecido con implementación de CSS y Bootstrap. Este proyecto refleja mi habilidad para crear páginas web elegantes y funcionales.",
        "url": "https://github.com/hector1489/cuppon"
      },
      {
        "id": 7,
        "name": "Carrito de compras",
        "image": "src/assets/img/Carrito2.png",
        "description": "Desarrollé un carrito de compras personalizado utilizando Vite y React. Este proyecto destaca mi capacidad para crear aplicaciones web dinámicas y eficientes.",
        "url": "https://github.com/hector1489/PyJ_Creaciones"
      },
      {
        "id": 8,
        "name": "Inmobiliaria",
        "image": "src/assets/img/inmobiliaria.png",
        "description": "Inmobiliaria es mi landing page de prueba, donde demuestro mis habilidades en las propiedades de display y JavaScript. Además de la estructura sólida, he incorporado alertas para mejorar la experiencia del usuario.",
        "url": "https://github.com/hector1489/inmobiliariajs"
      }
    ]
  }
